import streamlit as st

st.title("Υπολογισμός FIFO Αποθέματος Πετρελαίου")

# Ποσότητες (λίτρα)

st.subheader("Προσθήκη πετρελαίου")
Π1 = st.number_input("Ποσότητα παρτίδας 1 (λίτρα)", min_value=0.0)
τ1 = st.number_input("Τιμή παρτίδας 1 (€/λίτρο)", min_value=0.0)

Π2 = st.number_input("Ποσότητα παρτίδας 2 (λίτρα)", min_value=0.0)
τ2 = st.number_input("Τιμή παρτίδας 2 (€/λίτρο)", min_value=0.0)

Π3 = st.number_input("Ποσότητα παρτίδας 3 (λίτρα)", min_value=0.0)
τ3 = st.number_input("Τιμή παρτίδας 3 (€/λίτρο)", min_value=0.0)

st.subheader("Κατανάλωση πετρελαίου")
Κατ1 = st.number_input("Κατανάλωση μήνα")

def Υπολογισμός_αξίας(Κατ1,Π1,Π2,Π3,τ1,τ2,τ3):
    if Κατ1 <= Π1:
        Αξία_κατανάλωσης_μήνα = Κατ1 * τ1
        Π1 = Π1 - Κατ1
    elif Κατ1 > Π1:
        Αξία_κατανάλωσης_μήνα = (Π1 * τ1) + (Π2 * τ2) + (Π3 * τ3)
        Π1 = 0
        Π2 = Κατ1 - Π1
    
    return Αξία_κατανάλωσης_μήνα, Π1, Π2, Π3

x = Υπολογισμός_αξίας(Κατ1,Π1,Π2,Π3,τ1,τ2,τ3)
Αξία_μήνα, Π1, Π2, Π3 = Υπολογισμός_αξίας(
    Κατ1, Π1, Π2, Π3,τ1,τ2,τ3
)
st.text(f"Μένουν {Π1} λίτρα από παρτίδα 1, \n {Π2} από παρτίδα 2, \n {Π3} από παρτίδα 3 ")

# Υπολογισμοί
Αξία1 = Π1 * τ1
Αξία2 = Π2 * τ2
Αξία3 = Π3 * τ3

Αξία_Αποθεματικού = Αξία1 + Αξία2 + Αξία3



# Εμφάνιση
st.subheader("Αξία ανά παρτίδα")
st.write(f"Παρτίδα 1: {Αξία1:.2f} €")
if Αξία2 > 0:
    st.write(f"Παρτίδα 2: {Αξία2:.2f} €")
if Αξία3 > 0: 
    st.write(f"Παρτίδα 3: {Αξία3:.2f} €")

st.subheader("Συνολικό απόθεμα")
st.write(f"Η αξία του αποθεματικού είναι {Αξία_Αποθεματικού:.2f} €")
